from peewee import SqliteDatabase, IntegerField, Model, DateTimeField, CharField, ForeignKeyField, BooleanField
from datetime import datetime

db = SqliteDatabase('users.db', pragmas={'foreign_keys': 1})


def time_format():
    return datetime.now().strftime('%y.%m.%d %H:%M:%S.%f')[:-4]


class Petition(Model):
    class Meta:
        database = db
        db_table = "petition"

    petition_id = IntegerField()
    position_number = IntegerField()
    username = CharField()
    sign_date = CharField()
    

    def __str__(self):
        return f'{self.petition_id}: {self.position_number} {self.username} {self.sign_date}'


class Test(Model):
    class Meta:
        database = db
        db_table = "petition"

    petition_id = IntegerField()
    position_number = IntegerField()
    username = CharField()
    sign_date = CharField()



if __name__ == '__main__':
    # db.drop_tables([Parking, Own], safe=True)
    # db.create_tables([Petition], safe=True)
    db.create_tables([Test], safe=True)


# user_dict = {
#     "52532": 
#         {"1": ["Науменко Олег Ігорович", "02 серпня 2019"], "2": ["Дремо Павло Іванович", "02 серпня 2019"], "3": ["Москаленко Олександр Сергеевич", "02 серпня 2019"], "4": ["Касьянов Андрей Юрьевич", "02 серпня 2019"], 
#     "5": ["Руденко Сергій Леонідович", "02 серпня 2019"], "6": ["Капштик Олександр Володимирович", "02 серпня 2019"], "7": ["Кравчук Наталія Миколаївна", "02 серпня 2019"], "8": ["Батинчук Вадим Ігорович", "02 серпня 2019"], 
#     "9": ["Задорожня Дарина Олександрівна", "01 серпня 2019"], "10": ["Філіппов Максим Володимирович", "01 серпня 2019"], "11": ["Ташевський Сергій Володимирович", "01 серпня 2019"], "12": ["Кузів Ірина Володимирівна", "01 серпня 2019"], 
#     "13": ["Коноваленко Ростислав Олександрович", "01 серпня 2019"], "14": ["Ізвєков Віталій Володимирович", "01 серпня 2019"], "15": ["Кот Інна Сергіївна", "01 серпня 2019"], "16": ["Озерний Микола Іванович", "01 серпня 2019"], 
#     "17": ["Мулярчук Олександр Анатолійович", "01 серпня 2019"], "18": ["Заболонков Олександр Вікторович", "01 серпня 2019"], "19": ["Дубельт Олександр Сергійович", "01 серпня 2019"], "20": ["Коваль Артур Вікторович", "01 серпня 2019"], 
#     "21": ["Карібов Марат Валер'янович", "01 серпня 2019"], "22": ["Гуцалов Борис Юрійович", "01 серпня 2019"], "23": ["Ніколаєвська Дарія Олегівна", "01 серпня 2019"], "24": ["Хмельницький Валерій Володимирович", "01 серпня 2019"], 
#     "25": ["Присяжнюк Владислав Сергійович", "01 серпня 2019"], "26": ["Сагай Сергій Миколайович", "01 серпня 2019"], "27": ["Басанько Оксана Михайлівна", "01 серпня 2019"], "28": ["Євтодієва Віталія Олександрівна", "31 липня 2019"], 
#     "29": ["Онещак Артем Олегович", "31 липня 2019"], "30": ["Коновальчук  Надія  Миколаївна", "31 липня 2019"], "31": ["Пузанов Валерій Ігорович", "31 липня 2019"], "32": ["Толстов Дмитро Володимирович", "31 липня 2019"], 
#     "33": ["Зашаловський Сергій Сергійович", "31 липня 2019"], "34": ["Заболотний Станіслав Васильович", "31 липня 2019"], "35": ["Завершинський  Олександр Валерійович", "31 липня 2019"], "36": ["Снарський Євген Вікторович", "31 липня 2019"], 
#     "37": ["Земська Надія Володимирівна", "31 липня 2019"], "38": ["Сміліченко Юлія Анатоліївна", "31 липня 2019"], "39": ["Орловський Андрій Петрович", "31 липня 2019"], "40": ["Горб Олена Вікторівна", "31 липня 2019"], 
#     "41": ["Кузьменко Тарас Ілліч", "31 липня 2019"], "42": ["Привалов Руслан Олександрович", "31 липня 2019"], "43": ["Менжега Анна Вікторівна", "31 липня 2019"], "44": ["Мазулевський Олег Євгенович", "31 липня 2019"], 
#     "45": ["Соколов Євген Сергійович", "31 липня 2019"], "46": ["Сєргєєва Тетяна Анатоліївна", "31 липня 2019"], "47": ["Гореча Марта Нет", "31 липня 2019"], "48": ["Колєснік Віта Віталіївна", "31 липня 2019"], 
#     "49": ["Склярець Ірина Миколаївна", "31 липня 2019"], "50": ["Омелянський Тарас Іванович", "31 липня 2019"], "51": ["Задерака Юрій Сергійович", "30 липня 2019"], "52": ["Цимбалюк Андрій Миколайович", "30 липня 2019"], 
#     },
#     "55":
#         {"53": ["Ковальчук Олег Миколайович", "30 липня 2019"], "54": ["Кухар Андрій Леонідович", "30 липня 2019"], "55": ["Плахотня Людмила Миколаївна", "30 липня 2019"], "56": ["Волков Максим Максимович", "30 липня 2019"], 
#     "57": ["Вакула Андрій Андрійович", "30 липня 2019"], "58": ["Пешкова Патриція Ольга ", "30 липня 2019"], "59": ["Сніцарук Сергій Віталійович", "30 липня 2019"], "60": ["Пічугіна  Наталія  Володимирівна", "30 липня 2019"], 
#     "61": ["Софієнко Андрій Миколайович", "30 липня 2019"], "62": ["Солдатова Юлія Іванівна", "30 липня 2019"], "63": ["Мричко Олег Павлович", "30 липня 2019"], "64": ["Чиж Сергій Петрович", "30 липня 2019"], 
#     "65": ["Плахоцький Іван Іванович", "30 липня 2019"], "66": ["Чайка Алла Петрівна", "30 липня 2019"], "67": ["Куценко Ігор Сергійович", "30 липня 2019"], "68": ["Радченко Андрій Володимирович", "30 липня 2019"], 
#     "69": ["Гайдамачук Тетяна Григорівна", "30 липня 2019"], "70": ["Биченков Володимир Васильович", "30 липня 2019"], "71": ["Брик Володимир Олександрович", "30 липня 2019"], "72": ["Шкуро Тетяна Миколаївна", "30 липня 2019"], 
#     "73": ["Ковальчук Андрій Андрійович", "30 липня 2019"], "74": ["Тарасюк Тетяна Юріївна", "30 липня 2019"], "75": ["Скалій Олексій Михайлович", "30 липня 2019"], "76": ["Антоник  Петро  Миколайович ", "29 липня 2019"], 
#     "77": ["Подопригора Олександр Вячеславович", "29 липня 2019"], "78": ["Демчук  Ганна Сергіївна", "29 липня 2019"], "79": ["Жук Юрій Миколайович", "29 липня 2019"], "80": ["Дуригін Михайло Олександрович", "29 липня 2019"], 
#     "81": ["Чалий Дмитро Володимирович", "29 липня 2019"], "82": ["Платовський  Сергій  Євгенійович ", "29 липня 2019"], "83": ["Семука Віта Василівна", "29 липня 2019"], "84": ["Андрухович Тетяна Володимирівна", "29 липня 2019"], 
#     "85": ["Данилів Руслан Миронович", "29 липня 2019"], "86": ["Курінець Олена Олександрівна", "29 липня 2019"], "87": ["Гумен Петро Миронович", "29 липня 2019"], "88": ["Михальчук Марія Миколаївна", "29 липня 2019"], 
#     "89": ["Близнюк Катерина Анатоліївна", "29 липня 2019"], "90": ["Лавринович Юрій Петрович", "29 липня 2019"], "91": ["Горбачов Владислав Олександрович", "29 липня 2019"], "92": ["Бень Олег Аліханович", "29 липня 2019"], 
#     "93": ["Мельнічук Іван Юрійович", "29 липня 2019"], "94": ["Вячало Анастасія Анатоліївна", "29 липня 2019"], "95": ["Шевчук Олександр Михайлович", "29 липня 2019"], "96": ["Мельниченко Світлана Олександрівна", "29 липня 2019"], 
#     "97": ["Шевченко Вадим Петрович", "29 липня 2019"], "98": ["Яновский Александр Александрович", "29 липня 2019"], "99": ["Глушко Мар\"ян Михайлович", "28 липня 2019"], "100": ["Грама Олег Анатолійович", "28 липня 2019"], 
#     "101": ["Рубанець Олександр Віталійович", "28 липня 2019"], "102": ["Ульянова Наталья Володимирівна", "28 липня 2019"], "103": ["Медвецький Олег Михайлович", "28 липня 2019"], "104": ["Гуцол Юлія Іванівна", "28 липня 2019"], 
#     "105": ["Широчкін Валентин Серафимович", "28 липня 2019"], "106": ["Дорошко Олександр Олександрович", "28 липня 2019"], "107": ["Бабіцький  Дмитро Олегович", "28 липня 2019"], "108": ["Бортновська Олена Аркадіївна", "28 липня 2019"], 
#     "109": ["Сахно Любов Богданівна", "28 липня 2019"], "110": ["Кулініч Андрій Володимирович", "28 липня 2019"], "111": ["Заболотна Людмила Вікторівна", "28 липня 2019"], "112": ["Українцева Олена Валеріївна", "28 липня 2019"], 
#     "113": ["Клименко Роман Владиславович", "27 липня 2019"], "114": ["Скробач Олександр Іванович", "27 липня 2019"], "115": ["Євсеньова Наталія Михайлівна", "27 липня 2019"], "116": ["Король Артур Михайлович", "27 липня 2019"], 
#     "117": ["Заєв Сергій Іванович", "27 липня 2019"], "118": ["Кривша Сергій Олександрович", "27 липня 2019"],
#     }
    
# }

# for key, val in user_dict.items():
#     for k, v in val.items():
#         # writer.writerow([key, k, v[0], v[1]])
#         Petition.create(
#             petition_id = int(key),
#             position_number = int(k),
#             username = v[0],
#             sign_date = v[1]
#             )